{
  "components": {
    "NavContainer": {
      "headline": ""
    },
    "ArticlesContainer": {
      "headline": "",
      "articles": [
        {
          "title": "Reflections | Our Expectations of the Messiah",
          "description": "In Adam all die, meaning we will all go through the experience of physical death. Though many of us fear death constantly, we should not. Death may be an uncomfortable or miserable experience, however, we all must go through it in order to move onto imperishable bodies",
          "headline": "Reflections | Our Expectations of the Messiah",
          "date": "Feb, 11th 2017.",
          "paragraphs": [
            "As followers of Jesus the Messiah, it is very easy to fall into an incorrect view of scripture, such as many Israelites of Jesus’ time. Jesus came into our world as a blood sacrifice for the sins of all men, however, he has not yet fully consumated believers into the Kingdom of God on earth. The Bible explains that we do not know the day or the hour of that consumation… we do know that it is inevitable. As a side note, the definition of consumate is: verb. to bring to a state of perfection; fulfill.",
            "Though the Messiah came, many of the Jews did not have an accurate interpretation regarding the nature of his coming. They expected Jesus to take over Jerusalem in leadership as King and fully restore Israel to God. It is often said that the Jews expected the Messiah to be more of a militant, political figure that would unite Israel and prevail her over all Gentile nations. God actually did not do this. Instead, Jesus died a humiliating and brutal death on a cross.",
            "Great insight as to the nature of Jesus the Messiah is found in Matthew 20: 20-27: ",
            "“Then the mother of the sons of Zebedee came up to him with her sons, and kneeling before him she asked him for something. And he said to her, “What do you want?” She said to him, “Say that these two sons of mine are to sit, one at your right hand and one at your left, in your kingdom.” Jesus answered, “You do not know what you are asking. Are you able to drink the cup that I am to drink?” They said to him, “We are able.” He said to them, “You will drink my cup, but to sit at my right hand and at my left is not mine to grant, but it is for those for whom it has been prepared by my Father.” And when the ten heard it, they were indignant at the two brothers. But Jesus called them to him and said, “You know that the rulers of the Gentiles lord it over them, and their great ones exercise authority over them. It shall not be so among you. But whoever would be great among you must be your servant, and whoever would be first among you must be your slave, even as the Son of Man came not to be served but to serve, and to give his life as a ransom for many.”",
            "The Jews’ view of Jesus kingdom was much different than what God had planned. In our own lives, why do we think that all of our heart’s desires, hopes and dreams will or should occur during this lifespan of less than one hundred years? This is not a negative message, but one of truth and optimism. Is it really our efforts as humanity that will save the world? Is recycling plastic bottles really going to save the planet? ",
            "The apparent truth is that absolutely nothing is going to save the earth and humanity besides the Son of God, Jesus. He is able to restore nature, illness, death to a state of perfect harmony and Shalom. Let us not be confused and misled to think that this is going to happen necessarily in our lifetimes of by our efforts as united humanity. Jesus of Nazareth has put sin under his footstool.",
            "Paul gives us such a powerful insight of this beautiful phenomenon: ",
            "“For as in Adam all die, so also in Christ shall all be made alive. But each in his own order: Christ the firstfruits, then at his coming those who belong to Christ. Then comes the end, when he delivers the kingdom to God the Father after destroying every rule and every authority and power. For he must reign until he has put all his enemies under his feet. The last enemy to be destroyed is death. For “God has put all things in subjection under his feet.” But when it says, “all things are put in subjection,” it is plain that he is excepted who put all things in subjection under him. When all things are subjected to him, then the Son himself will also be subjected to him who put all things in subjection under him, that God may be all in all.”",
            "In Adam all die, meaning we will all go through the experience of physical death. Though many of us fear death constantly, we should not. Death may be an uncomfortable or miserable experience, however, we all must go through it in order to move onto imperishable bodies and be united with God in heaven. Let us stop expecting everything to go well for us in this life and transfer that hope to the eternal kingdom of God our Father."
          ]
        },
        {
          "title": "The Mystery of God: He is a particular God",
          "description": "In a world of political correctness and equal opportunity, it is provocative to claim that the sole maker of the universe is a particular being.",
          "headline": "The Mystery of God: He is a particular God",
          "date": "Feb, 8th 2017.",
          "paragraphs": [
            "In a world of political correctness and equal opportunity, it is provocative to claim that the sole maker of the universe is a particular being. Our God, the being who truly breathed our universe into existence, inspired this section of Psalm 76:",
            "In Judah God is known; his name is great in Israel. His abode has been established in Salem, his dwelling place in Zion. Psalm 76: 1-2",
            "God reveals much about his character throughout the Old Testament. A true follower of the Messiah Jesus has a warm fascination and affinity toward the people of Israel. Throughout history, those who persecute the people of Israel make a poor decision as God guarantees to maintain his covenant with the Jewish people. Jesus himself is Jewish.",
            "In whatever obstacles we face throughout this life, the God of Israel is present with those who have confessed that his son, Jesus is Lord. God will see us through and has prepared for us who love him a beautiful inheritance beyond our imagination in the new world to soon come. In this time we focus on serving and following him because his coming is at any minute and his kingdom is inexplicable more glorious that any of our worldly pursuits in this lifetime.",
            "Jesus said to them, “Truly, I say to you, in the new world, when the Son of Man will sit on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel. And everyone who has left houses or brothers or sisters or father or mother or children or lands, for my name's sake, will receive a hundredfold and will inherit eternal life.” Mt. 19: 28-29"
          ]
        },
        {
          "title": "JUST IN: Death is defeated by man born in Israel",
          "description": "According to the Bible, every person to ever live has sinned and is therefore in debt to God. God’s righteous judgement upon sin is death itself.",
          "headline": "JUST IN: Death is defeated by man born in Israel",
          "date": "Feb, 6th 2017.",
          "paragraphs": [
            "In Jesus' story of the unforgiving servant, a servant is forgiven of a massive debt after tirelessly pleading with his master. After being forgiven of the debt, the servant enters back into everyday life. He encounters one of his own servants, who owes him a debt relatively smaller and decides to not show the same mercy upon his own servant that his master had shown.",
            "'And in anger his master delivered him to the jailers, until he should pay all his debt. Mt. 18:34'",
            "Whether my own heart likes to believe it or not, it is simply a true statement that I owe God an unattainable debt for the sin I have committed against him. It is a plain fact that I have sinned against my creator multiple times throughout my life.",
            "Does Jesus not say, “But I say to you that everyone who looks at a woman with lustful intent has already committed adultery with her in his heart.” Mt. 5:28",
            "According to the Bible, every person to ever live has sinned and is therefore in debt to God. God’s righteous judgement upon sin is death itself. Our Messiah, Jesus of Nazareth is a rescuer. He is the source of our salvation. He is our savior. Why do we attribute such titles to this man?",
            "The original sin of Adam in the Garden of Eden is the historical point at which death came into the universe. The main reason why we fear death is because deep in our hearts we know we are guilty… in fact, we are! Death was never meant to be a “a natural part of the life cycle”, or “normal” as many are taught within modern school curriculums. Rather, death is natural and did not always exist in the natural order! Death itself was introduced as a punishment for sin at a specific point in history. This indicates that death is not a natural phenomenon. If you are willing to believe, this is great news!",
            "Far too often, we under-emphasize the effects of sin. This leads to a misunderstanding as to why the world is in such a state of turmoil. Let us have no doubt that the One who gave us the Holy Scriptures is true in all that he has said about us and Himself. Let us not make any less than true the claims of God.",
            "God is in fact very active in the lives of people throughout the earth. God is actively convicting those whose he chooses of their sin and bringing them to a posture of repentance. God listens to the prayers of his children who are interceding of behalf of others who remain lost in sin.",
            "Thanks be to God for revealing the true reason why death is everywhere in this world. God has shown us that death will perish forever. It has been God’s plan all along to defeat death through the loving sacrifice of his own very son, Jesus: Israel’s Messiah. Jesus experienced the same very death that we will all inevitably face. God raised him out of his grave, never to have death in his future again."
          ]
        },
        {
          "title": "Breaking News: Christianity is offensive to the world.",
          "description": "As the world approaches the triumphant return of Jesus the Messiah, a gray and certainly satanic sentiment fills the realm of modern thought.",
          "headline": "Breaking News: Christianity is offensive to the world.",
          "date": "Feb, 3rd 2017.",
          "paragraphs": [
            "As the world approaches the triumphant return of Jesus the Messiah, a gray and certainly satanic sentiment fills the realm of modern thought. An unpleasant trickery has led millions, if not billions of souls astray from an everlasting relationship with their maker.",
            "Amongst his disciples, Jesus claims, “I am the way, the truth, and the life. No one can come to the Father except through me. If you had really known me, you would know who my Father is. From now on, you do know him and have seen him!” John 14: 6-7.",
            "Jesus’ teaching is blatantly straightforward. The the idea that all world-views contain truth should not make sense to the follower of Christ. Western society, particularly that of the United States, has blurred the basic concept of absolute truth. Here, it is considered offensive to claim that one belief is correct over another. This society does not believe in whole truth at all, therefore there is a lack of dialogue and debate between proponents of differing truth claims.",
            "In 1 Kings 8, the prophet Elijah comes face to face with those of differing beliefs. He says: “You prophets of Baal, pray to your god, and I will pray to the Lord. The god who answers by setting fire to his wood is the true God.",
            "The scriptures reveal to us that Elijah’s God triumphs, while the prophets of Baal are brought to utter shame and subsequent death. Fast forward to the latter days: the year 2017. The world’s central dilemma is not wealth inequality or racial tension, rather, it is the fact that truth is indeed real. At this moment, enormous populations of this earth have devoted their hearts to conflicting truth claims. Is this not an inherent dilemma?",
            "“Very truly I tell you,” Jesus answered, “before Abraham was born, I am!” At this, they picked up stones to stone him, but Jesus hid himself, slipping away from the temple grounds. John 8: 58-59",
            "Let anyone who is willing to be comforted by the unshakable truth be assured that life was created by a particular spiritual being: the God of the Bible. Jesus of Nazareth really was born of a virgin woman, named Mary, in Israel around 2,000 years ago. This man really is the beloved Son of God, or Messiah. Praise be the God our Savior and thanks be to the Lord Jesus Christ for not abandoning us in our sin and confusion. He is always faithful to those who are willing to believe that He is their loving Creator."
          ]
        }
      ]
    },
    "FooterContainer": {
      "headline": ""
    }
  }
}
